linux/Vim实用技巧.org
#+TITLE: Vim实用技巧
#+AUTHOR: DarkSun
#+OPTIONS: ^:{}

* Vim决问题的方式
  * >G命令会增加当前行到文档末尾的缩进层次

  * Vim中可重复的操作及回退
	#+CAPTION:Vim中可重复的操作及回退
    | 目的                               | 操作                  | 重复                                | 回退 |
    |------------------------------------+-----------------------+-------------------------------------+------|
    | 做出修改                           | {edit}                | .                                   | u    |
    | 在行内查找下一指定字符[前一个字符] | f{char}/t{char}       | ;                                   | ,    |
    | 在行内查找上一指定字符[后一个字符] | F{char}/T{char}       | ;                                   | ,    |
    | 在文档中查询下一处匹配项           | /pattern<CR>          | n                                   | N    |
    | 在文档中查询下一处匹配项           | ?pattern<CR>          | n                                   | N    |
    | 执行替换                           | :s/target/replacement | &                                   | u    |
    | 宏操作                             | q{register}{changes}q | @{register}                         | u    |
    | 执行Ex命令                         | :Ex命令               | @:(:寄存器总是存储最后一次的Ex命令) | u    |
* 普通模式
  
  * 学会把d{motion}与/查找动作一起使用,可以极大提高效率

  * 改变大小写

    * gU{motion} 修改为大写

	* gu{motion} 修改为小写

	* g~{motion} 大小写翻转

	* gUgU 修改当前行为大写

	* gugu 修改当前行为小写

	* g~g~ 当前行大小写翻转

  * 缩进

	* >{motion} 增加缩进

	* <{motion} 减少缩进

	* ={motion} 自动缩进

  * 数字运算

	* C-a +1

	* C-x -1

  * 虚拟替换模式
	
	+ gR 进入虚拟连续替换模式,它把tab当成一组空格来处理

	+ gr 进入虚拟单词替换模式,它把tab当成一组空格来处理

  * 移动
    | 操作   | 作用                                                                                                             |
    |--------+------------------------------------------------------------------------------------------------------------------|
    | j k    | 按照实际行向下向上移动                                                                                           |
    | gj和gk | 按照屏幕行向下向上移动                                                                                           |
    | ge     | 反向移动到上一个单词的结尾                                                                                       |
    | gf     | 跳转到光标所在字符串所表示的文件,通过配置suffixesadd选项,允许省略文件后缀名,通过配置path属性可以省略部分目录信息 |
    | ``     | 当前文件中上次跳转动作之前的位置                                                                                 |
    | `.     | 上次修改的位置                                                                                                   |
    | `^     | 上次插入的地方                                                                                                   |
    | `[     | 上次修改或复制的起始位置                                                                                         |
    | `]     | 上次修改或复制的结束位置                                                                                         |
    | `<     | 上次高亮选区的起始位置                                                                                           |
    | `>     | 上次高亮选区的结束位置                                                                                           |
    | H      | 跳转到屏幕最上方                                                                                                 |
    | M      | 跳转到屏幕正中间                                                                                                 |
    | L      | 跳转到屏幕最下方                                                                                                 |

  * 按子串移动

	子串比单词的范围更大,它仅仅以空白字符作为分隔依据.

	+ W 类似w,移动到下一个字串

	+ B 类似b,移动到上一个字串

	+ E 类似e,移动到子串的字部

	+ gE 类似ge,移动到上一个字串的尾部

  * 行列定位
	
	+ 使用{N}G定位到N行

	+ 使用{N}|定位到N列
* 插入模式
  * 更正错误

	+ C-h 删除前一个字符

	+ C-w 删除前一个单词

	+ C-u 删除到行首

  * 返回普通模式

	+ ESC 或者 C-[  切换到普通模式

	+ C-o 切换到插入-普通模式

  * 寄存器

	+ C-r {register} 访问寄存器中的内容

	+ C-r C-p {register} 访问寄存器中的内容

	+ C-r = 访问表达式寄存器,通过访问该特殊寄存器可以执行计算式甚至一段Vim脚本

  * 插入特殊字符

	+ C-v u {1234} 以4为16进制编码来输入字符

	+ 普通模式下ga  显示光标所在的字符编码

	+ C-v 非数字键  插入这个按键本身所代表的字符

	+ C-k{char1}{char2}  以二合字母插入非常用字符

	+ :digraphs 查看可用的二合字母列表

	+ :digraph-table 查看另一个更为有用的列表

* 可视模式
  * gv 重选上次的高亮选区

  * o  切换高亮选区的活动端

  * 当实用命令.重复对高亮选区所做的修改时,此修改会重复作用域相同范围的文本

  * 在windows下使用C-q进入列块编辑模式,而在linux下使用C-v进入列块编辑模式,在emacs的evil-mode下,也使用C-v进入列块模式
	
* 命令行模式
** 操作文本的Ex命令
   | 命令                                         | 用途                                        |
   |----------------------------------------------+---------------------------------------------|
   | :[range]delete [register]                    | 删除指定范围的行到register中                |
   | :[range]yank [register]                      | 赋值指定范围的行到register中                |
   | :[line]put [register]                        | 在指定行后粘贴register的内容                |
   | :[range]copy {address}                       | 将指定范围的行拷贝到{address}所指定的行之下 |
   | :[range]move {address}                       | 将指定范围的行移动到{address}所指定的行之下 |
   | :[range]join                                 | 连接指定范围的行                            |
   | :[range]normal {commands}                    | 对指定范围的每一行执行普通命令              |
   | :[range]substitute/{pattern}/{string}/{flag} | 正则替换                                    |
   | :[range]global/{pattern}/{cmd}               | 对给定范围内匹配的行,在上面执行Ex命令       |
   | :[range]vglobal/{pattern}/{cmd}              | global的取反                                |
   | :[range]global!/{pattern}/{cmd}             | global的取反                                |
   | :grep /vimgrep                               | 搜索关键字                                  |

