linux/Vim实用技巧.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Vim实用技巧</title>
<!-- 2014-09-01 星期一 23:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="DarkSun" />




</head>
<body>
<div id="content">
<h1 class="title">Vim实用技巧</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Vim决问题的方式</a></li>
<li><a href="#sec-2">2. 普通模式</a></li>
<li><a href="#sec-3">3. 插入模式</a></li>
<li><a href="#sec-4">4. 可视模式</a></li>
<li><a href="#sec-5">5. 命令行模式</a>
<ul>
<li><a href="#sec-5-1">5.1. 操作文本的Ex命令</a></li>
<li><a href="#sec-5-2">5.2. range服务说明</a></li>
<li><a href="#sec-5-3">5.3. 补全</a></li>
<li><a href="#sec-5-4">5.4. 命令行窗口&#x2013;使用vim的编辑能力编辑Ex命令</a></li>
<li><a href="#sec-5-5">5.5. 执行外部命令</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 管理多个文件</a>
<ul>
<li><a href="#sec-6-1">6.1. 缓冲区列表管理</a></li>
<li><a href="#sec-6-2">6.2. 参数列表</a></li>
<li><a href="#sec-6-3">6.3. 窗口操作</a></li>
<li><a href="#sec-6-4">6.4. 标签页操作</a></li>
</ul>
</li>
<li><a href="#sec-7">7. 打开及保存文件</a>
<ul>
<li><a href="#sec-7-1">7.1. 打开文件</a></li>
<li><a href="#sec-7-2">7.2. 使用find查找文件</a></li>
<li><a href="#sec-7-3">7.3. 使用netrw管理文件系统</a></li>
</ul>
</li>
<li><a href="#sec-8">8. 寄存器</a></li>
<li><a href="#sec-9">9. 宏</a></li>
<li><a href="#sec-10">10. 模式匹配</a>
<ul>
<li><a href="#sec-10-1">10.1. 调整大小写敏感</a></li>
<li><a href="#sec-10-2">10.2. 调整正则表达式的匹配模式</a></li>
<li><a href="#sec-10-3">10.3. 特殊匹配符</a></li>
<li><a href="#sec-10-4">10.4. 统计当前模式的匹配个数</a></li>
</ul>
</li>
<li><a href="#sec-11">11. 查找功能</a></li>
<li><a href="#sec-12">12. 替换功能</a>
<ul>
<li><a href="#sec-12-1">12.1. 标志位总结</a></li>
<li><a href="#sec-12-2">12.2. 替换域中的特殊字符</a></li>
<li><a href="#sec-12-3">12.3. 使用寄存器内容</a></li>
<li><a href="#sec-12-4">12.4. 重复上一次substitute命令</a></li>
</ul>
</li>
<li><a href="#sec-13">13. Quckfix列表与位置列表</a></li>
<li><a href="#sec-14">14. 与外部程序的交互</a></li>
<li><a href="#sec-15">15. Vim中的补全功能</a></li>
<li><a href="#sec-16">16. 拼写检查</a>
<ul>
<li><a href="#sec-16-1">16.1. Vim拼写检查器的基本命令</a></li>
<li><a href="#sec-16-2">16.2. 使用其他拼写字典</a></li>
<li><a href="#sec-16-3">16.3. 在插入模式下更正拼写错误</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Vim决问题的方式</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>&gt;G命令会增加当前行到文档末尾的缩进层次
</li>

<li>Vim中可重复的操作及回退
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">目的</th>
<th scope="col" class="left">操作</th>
<th scope="col" class="left">重复</th>
<th scope="col" class="left">回退</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">做出修改</td>
<td class="left">{edit}</td>
<td class="left">.</td>
<td class="left">u</td>
</tr>

<tr>
<td class="left">在行内查找下一指定字符[前一个字符]</td>
<td class="left">f{char}/t{char}</td>
<td class="left">;</td>
<td class="left">,</td>
</tr>

<tr>
<td class="left">在行内查找上一指定字符[后一个字符]</td>
<td class="left">F{char}/T{char}</td>
<td class="left">;</td>
<td class="left">,</td>
</tr>

<tr>
<td class="left">在文档中查询下一处匹配项</td>
<td class="left">/pattern&lt;CR&gt;</td>
<td class="left">n</td>
<td class="left">N</td>
</tr>

<tr>
<td class="left">在文档中查询下一处匹配项</td>
<td class="left">?pattern&lt;CR&gt;</td>
<td class="left">n</td>
<td class="left">N</td>
</tr>

<tr>
<td class="left">执行替换</td>
<td class="left">:s/target/replacement</td>
<td class="left">&amp;</td>
<td class="left">u</td>
</tr>

<tr>
<td class="left">宏操作</td>
<td class="left">q{register}{changes}q</td>
<td class="left">@{register}</td>
<td class="left">u</td>
</tr>

<tr>
<td class="left">执行Ex命令</td>
<td class="left">:Ex命令</td>
<td class="left">@:(:寄存器总是存储最后一次的Ex命令)</td>
<td class="left">u</td>
</tr>
</tbody>
</table>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 普通模式</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>学会把d{motion}与/查找动作一起使用,可以极大提高效率
</li>

<li>改变大小写

<ul class="org-ul">
<li>gU{motion} 修改为大写
</li>

<li>gu{motion} 修改为小写
</li>

<li>g~{motion} 大小写翻转
</li>

<li>gUgU 修改当前行为大写
</li>

<li>gugu 修改当前行为小写
</li>

<li>g~g~ 当前行大小写翻转
</li>
</ul>
</li>

<li>缩进

<ul class="org-ul">
<li>&gt;{motion} 增加缩进
</li>

<li>&lt;{motion} 减少缩进
</li>

<li>={motion} 自动缩进
</li>
</ul>
</li>

<li>数字运算

<ul class="org-ul">
<li>C-a +1
</li>

<li>C-x -1
</li>
</ul>
</li>

<li>虚拟替换模式

<ul class="org-ul">
<li>gR 进入虚拟连续替换模式,它把tab当成一组空格来处理
</li>

<li>gr 进入虚拟单词替换模式,它把tab当成一组空格来处理
</li>
</ul>
</li>

<li>移动
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">操作</th>
<th scope="col" class="left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">j k</td>
<td class="left">按照实际行向下向上移动</td>
</tr>

<tr>
<td class="left">gj和gk</td>
<td class="left">按照屏幕行向下向上移动</td>
</tr>

<tr>
<td class="left">ge</td>
<td class="left">反向移动到上一个单词的结尾</td>
</tr>

<tr>
<td class="left">gf</td>
<td class="left">跳转到光标所在字符串所表示的文件,通过配置suffixesadd选项,允许省略文件后缀名,通过配置path属性可以省略部分目录信息</td>
</tr>

<tr>
<td class="left">``</td>
<td class="left">当前文件中上次跳转动作之前的位置</td>
</tr>

<tr>
<td class="left">`.</td>
<td class="left">上次修改的位置</td>
</tr>

<tr>
<td class="left">`^</td>
<td class="left">上次插入的地方</td>
</tr>

<tr>
<td class="left">`[</td>
<td class="left">上次修改或复制的起始位置</td>
</tr>

<tr>
<td class="left">`]</td>
<td class="left">上次修改或复制的结束位置</td>
</tr>

<tr>
<td class="left">`&lt;</td>
<td class="left">上次高亮选区的起始位置</td>
</tr>

<tr>
<td class="left">`&gt;</td>
<td class="left">上次高亮选区的结束位置</td>
</tr>

<tr>
<td class="left">H</td>
<td class="left">跳转到屏幕最上方</td>
</tr>

<tr>
<td class="left">M</td>
<td class="left">跳转到屏幕正中间</td>
</tr>

<tr>
<td class="left">L</td>
<td class="left">跳转到屏幕最下方</td>
</tr>
</tbody>
</table>
</li>

<li>按子串移动

<p>
子串比单词的范围更大,它仅仅以空白字符作为分隔依据.
</p>

<ul class="org-ul">
<li>W 类似w,移动到下一个字串
</li>

<li>B 类似b,移动到上一个字串
</li>

<li>E 类似e,移动到子串的字部
</li>

<li>gE 类似ge,移动到上一个字串的尾部
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 插入模式</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>更正错误

<ul class="org-ul">
<li>C-h 删除前一个字符
</li>

<li>C-w 删除前一个单词
</li>

<li>C-u 删除到行首
</li>
</ul>
</li>

<li>返回普通模式

<ul class="org-ul">
<li>ESC 或者 C-[  切换到普通模式
</li>

<li>C-o 切换到插入-普通模式
</li>
</ul>
</li>

<li>寄存器

<ul class="org-ul">
<li>C-r {register} 访问寄存器中的内容
</li>

<li>C-r C-p {register} 访问寄存器中的内容
</li>

<li>C-r = 访问表达式寄存器,通过访问该特殊寄存器可以执行计算式甚至一段Vim脚本
</li>
</ul>
</li>

<li>插入特殊字符

<ul class="org-ul">
<li>C-v u {1234} 以4为16进制编码来输入字符
</li>

<li>普通模式下ga  显示光标所在的字符编码
</li>

<li>C-v 非数字键  插入这个按键本身所代表的字符
</li>

<li>C-k{char1}{char2}  以二合字母插入非常用字符
</li>

<li>:digraphs 查看可用的二合字母列表
</li>

<li>:digraph-table 查看另一个更为有用的列表
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 可视模式</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>gv 重选上次的高亮选区
</li>

<li>o  切换高亮选区的活动端
</li>

<li>当实用命令.重复对高亮选区所做的修改时,此修改会重复作用域相同范围的文本
</li>

<li>在windows下使用C-q进入列块编辑模式,而在linux下使用C-v进入列块编辑模式,在emacs的evil-mode下,也使用C-v进入列块模式
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 命令行模式</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 操作文本的Ex命令</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:[range]delete [register]</td>
<td class="left">删除指定范围的行到register中</td>
</tr>

<tr>
<td class="left">:[range]yank [register]</td>
<td class="left">赋值指定范围的行到register中</td>
</tr>

<tr>
<td class="left">:[line]put [register]</td>
<td class="left">在指定行后粘贴register的内容</td>
</tr>

<tr>
<td class="left">:[range]copy {address}</td>
<td class="left">将指定范围的行拷贝到{address}所指定的行之下</td>
</tr>

<tr>
<td class="left">:[range]move {address}</td>
<td class="left">将指定范围的行移动到{address}所指定的行之下</td>
</tr>

<tr>
<td class="left">:[range]join</td>
<td class="left">连接指定范围的行</td>
</tr>

<tr>
<td class="left">:[range]normal {commands}</td>
<td class="left">对指定范围的每一行执行普通命令</td>
</tr>

<tr>
<td class="left">:[range]substitute/{pattern}/{string}/{flag}</td>
<td class="left">正则替换</td>
</tr>

<tr>
<td class="left">:[range]global/{pattern}/{cmd}</td>
<td class="left">对给定范围内匹配的行,在上面执行Ex命令</td>
</tr>

<tr>
<td class="left">:[range]vglobal/{pattern}/{cmd}</td>
<td class="left">global的取反</td>
</tr>

<tr>
<td class="left">:[range]global!/{pattern}/{cmd}</td>
<td class="left">global的取反</td>
</tr>

<tr>
<td class="left">:grep /vimgrep</td>
<td class="left">搜索关键字</td>
</tr>
</tbody>
</table>
</div>
</div>
