linux/Vim实用技巧.org
** range服务说明
   | 符号 | 地址                        |
   |------+-----------------------------|
   | N    | 文件的第N行                 |
   | $    | 文件的最后一行              |
   | 0    | 虚拟行,位于文件第一行的上方 |
   | .    | 光标所在行                  |
   | 'm   | 包含位置标记m的行           |
   | '<   | 高亮选区的起始行            |
   | '>   | 高亮选区的结束行            |
   | %    | 整个文件(:1,$的简写形式)     |
   |      |                              |
** 补全
   * C-d 显示可用的补全列表
   * Tab 自动补全
   * C-r C-w 插入光标下的单词
   * C-r C-a 插入光标下的子串
** 命令行窗口--使用vim的编辑能力编辑Ex命令
   | 命令         | 动作                         |
   |--------------+------------------------------|
   | q/           | 打开查找命令历史的命令行窗口 |
   | q:           | 打开Ex命令历史的命令行窗口   |
   | C-f          | 从命令行模式切换到命令行窗口 |
   | :help cmdwin | 查看命令行帮助                      |
** 执行外部命令
   | 命令                | 用途                                        |
   |---------------------+---------------------------------------------|
   | :shell              | 启动shell                                   |
   | :!{cmd}             | 在shell中执行cmd                            |
   | :read !{cmd}        | 在shell中执行cmd,并把标准输出插入到光标下方 |
   | [range]write !{cmd} | 在shell中执行{cmd},以[range]作为其标准输入    |
   | [range]!{fiter}       | 使用外部命令{filter}过滤指定的[range]                 |
* 管理多个文件
** 缓冲区列表管理
   | 命令              | 用途                |
   |-------------------+---------------------|
   | :ls               | 列出缓冲区列表      |
   | :bnext            | 上一个缓冲区        |
   | :bprev            | 下一个缓冲区        |
   | :bfirst           | 列表开头的buffer    |
   | :blast            | 列表结尾的buffer    |
   | :buffer N         | 第N号buffer         |
   | :buffer {bufname} | 匹配bufname的buffer |
   | :bdelete N1 N2... | 删除buffer          |
   | :N,M bdelete      | 删除buffer        |
   | :bufdo            | 在:ls列出的所有缓冲区执行Ex命令 |
   |                   |                                 |
** 参数列表

   参数列表记录了在启动时作为参数传递給Vim的文件列表. 通过设置参数列表,可以通过:nexthe :prev来打开下一个/上一个文件

   * :args 显示当前参数列表的内容

   * :args {filelist} 设置文件列表

   * :args {文件通配符} 设置符合文件通配的文件列表
	 
	 其中,
	 1. *符号用于匹配0到多个字符,但范围仅限于指定的目录

	 2. ** 也匹配0到多个字符,范围递归进入目录的子目录

   * :args `shell命令` 以shell命令的输出作为参数列表的值

   * :argdo命令在列表中的每个缓冲区上执行同一条命令

   * 在使用:argdo/:bufdo前,最好启用'hidden'设置.

	 启用hidden选项后,如果活动的缓冲区的内容发生了变化,Vim会在离开该缓冲区时自动将其隐藏. 否则Vim会阻止离开该缓冲区. 这样我们就无法用:argdo或:bufdo命令来修改一组缓冲区.
** 窗口操作
   | 操作           | 用途                                |
   |----------------+-------------------------------------|
   | C-w s          | 水平分割当前窗口                    |
   | C-w v          | 垂直分割当前窗口                    |
   | :split {file}  | 水平分割当前窗口,并在新窗口载入file |
   | :vsplit {file} | 垂直分割当前窗口,并在新窗口载入file |
   | C-w w          | 在窗口间循环切换                    |
   | C-w c或:close  | 关闭活动窗口                        |
   | C-w o或:only   | 只保留活动窗口,关闭其他所有窗口     |
   | C-w =          | 使所有窗口等宽,等高                 |
   | C-w _          | 最大化活动窗口的高度                |
   | [N]C-w _       | 将活动窗口的高度设为N行             |
   | C-w 竖线       | 类似C-w _,但设置窗口的宽                 |
** 标签页操作

   Vim的标签页是可以容纳一系列窗口的容器,它类似于Linux中的虚拟桌面的概念
   | 命令                | 用途                            |
   |---------------------+---------------------------------|
   | :tabedit {filename} | 在新标签页打开{filename}        |
   | C-w T               | 把当前窗口移到一个新标签页      |
   | :tabclose           | 关闭当前标签页                  |
   | :tabonly            | 只保留当前标签页,关闭其他标签页 |
   | :tabnext{n}或{N}gt    | 切换到编号为{N}的标签页          |
   | :tabnext或gt          | 切换到下一个标签页               |
   | :tabprevious或gT      | 切换到上一个标签页               |
   | :tabmove [N]          | 将当前标签页移动到第N个位置,默认为最后一个位置         |
* 打开及保存文件
** 打开文件
   * :pwd          查看当前工作目录,所谓工作目录只的是vim启动时的那个目录,该目录 *不随着* buffer路径的不同而不同

   * :edit %<TAB>  %符号代表缓冲区中的完整路径

   * :edit %:h     :h修饰符会去除文件名,但保留路径部分,使用这种方式可以快速打开与活动缓冲区中文件属于同一个目录的文件

** 使用find查找文件

   :find命令运行我们通过文件名打开一个文件,而无需输入该文件的完整路径. 

   在使用该功能前先需要配置path选项

   1. :set path+=app/**
   2. :find recvfrommb<tab>

** 使用netrw管理文件系统

* 寄存器
  
  * 使用寄存器

	"{register}复制/删除操作

  * 无名寄存器

	若没有指定寄存器,则Vim缺省使用无名寄存器,可以使用""表示. 它是极其易变的

  * 复制专用寄存器

	使用y{motion}时,不仅会把内容存入无名寄存器,而会存入复制专用寄存器,可用"0来表示

  * 有名寄存器

	用小些字母a-z引用寄存器,会覆盖原寄存器内容. 而用大写字母A-Z引用寄存器,则会将新内容添加到该寄存器的原有内容之后

  * 黑洞寄存器

	使用"_来引用,该寄存器不保存任何内容

  * 系统剪贴板

	使用"+来引用,该寄存器与系统剪贴板相关联

  * 主剪贴板

	X11视窗支持另一种叫做主剪贴板的剪贴板(primary),它高村者上次被高亮选中的文本,可用用鼠标中键把他们粘贴出来. 使用"*来引用

	Windows/Mac OS没有主剪贴板的概念,因此"*也代表系统剪贴板

  * 其他寄存器

    | 寄存器 | 内容           |
    |--------+----------------|
    | "=     | 表达式寄存器   |
    | "%     | 当前文件名     |
    | "#     | 轮换文件名     |
    | ".     | 上次插入的文本 |
    | ":      | 上次执行的Ex命令 |
    | "/       | 上次查找的模式          |

