linux/Vim实用技巧.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> range服务说明</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">符号</th>
<th scope="col" class="left">地址</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">N</td>
<td class="left">文件的第N行</td>
</tr>

<tr>
<td class="left">$</td>
<td class="left">文件的最后一行</td>
</tr>

<tr>
<td class="left">0</td>
<td class="left">虚拟行,位于文件第一行的上方</td>
</tr>

<tr>
<td class="left">.</td>
<td class="left">光标所在行</td>
</tr>

<tr>
<td class="left">'m</td>
<td class="left">包含位置标记m的行</td>
</tr>

<tr>
<td class="left">'&lt;</td>
<td class="left">高亮选区的起始行</td>
</tr>

<tr>
<td class="left">'&gt;</td>
<td class="left">高亮选区的结束行</td>
</tr>

<tr>
<td class="left">%</td>
<td class="left">整个文件(:1,$的简写形式)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 补全</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>C-d 显示可用的补全列表
</li>
<li>Tab 自动补全
</li>
<li>C-r C-w 插入光标下的单词
</li>
<li>C-r C-a 插入光标下的子串
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 命令行窗口&#x2013;使用vim的编辑能力编辑Ex命令</h3>
<div class="outline-text-3" id="text-5-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">动作</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">q/</td>
<td class="left">打开查找命令历史的命令行窗口</td>
</tr>

<tr>
<td class="left">q:</td>
<td class="left">打开Ex命令历史的命令行窗口</td>
</tr>

<tr>
<td class="left">C-f</td>
<td class="left">从命令行模式切换到命令行窗口</td>
</tr>

<tr>
<td class="left">:help cmdwin</td>
<td class="left">查看命令行帮助</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 执行外部命令</h3>
<div class="outline-text-3" id="text-5-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:shell</td>
<td class="left">启动shell</td>
</tr>

<tr>
<td class="left">:!{cmd}</td>
<td class="left">在shell中执行cmd</td>
</tr>

<tr>
<td class="left">:read !{cmd}</td>
<td class="left">在shell中执行cmd,并把标准输出插入到光标下方</td>
</tr>

<tr>
<td class="left">[range]write !{cmd}</td>
<td class="left">在shell中执行{cmd},以[range]作为其标准输入</td>
</tr>

<tr>
<td class="left">[range]!{fiter}</td>
<td class="left">使用外部命令{filter}过滤指定的[range]</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 管理多个文件</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 缓冲区列表管理</h3>
<div class="outline-text-3" id="text-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:ls</td>
<td class="left">列出缓冲区列表</td>
</tr>

<tr>
<td class="left">:bnext</td>
<td class="left">上一个缓冲区</td>
</tr>

<tr>
<td class="left">:bprev</td>
<td class="left">下一个缓冲区</td>
</tr>

<tr>
<td class="left">:bfirst</td>
<td class="left">列表开头的buffer</td>
</tr>

<tr>
<td class="left">:blast</td>
<td class="left">列表结尾的buffer</td>
</tr>

<tr>
<td class="left">:buffer N</td>
<td class="left">第N号buffer</td>
</tr>

<tr>
<td class="left">:buffer {bufname}</td>
<td class="left">匹配bufname的buffer</td>
</tr>

<tr>
<td class="left">:bdelete N1 N2&#x2026;</td>
<td class="left">删除buffer</td>
</tr>

<tr>
<td class="left">:N,M bdelete</td>
<td class="left">删除buffer</td>
</tr>

<tr>
<td class="left">:bufdo</td>
<td class="left">在:ls列出的所有缓冲区执行Ex命令</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 参数列表</h3>
<div class="outline-text-3" id="text-6-2">
<p>
参数列表记录了在启动时作为参数传递給Vim的文件列表. 通过设置参数列表,可以通过:nexthe :prev来打开下一个/上一个文件
</p>

<ul class="org-ul">
<li>:args 显示当前参数列表的内容
</li>

<li>:args {filelist} 设置文件列表
</li>

<li>:args {文件通配符} 设置符合文件通配的文件列表

<p>
其中,
</p>
<ol class="org-ol">
<li>*符号用于匹配0到多个字符,但范围仅限于指定的目录
</li>

<li>** 也匹配0到多个字符,范围递归进入目录的子目录
</li>
</ol>
</li>

<li>:args `shell命令` 以shell命令的输出作为参数列表的值
</li>

<li>:argdo命令在列表中的每个缓冲区上执行同一条命令
</li>

<li>在使用:argdo/:bufdo前,最好启用'hidden'设置.

<p>
启用hidden选项后,如果活动的缓冲区的内容发生了变化,Vim会在离开该缓冲区时自动将其隐藏. 否则Vim会阻止离开该缓冲区. 这样我们就无法用:argdo或:bufdo命令来修改一组缓冲区.
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 窗口操作</h3>
<div class="outline-text-3" id="text-6-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">操作</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-w s</td>
<td class="left">水平分割当前窗口</td>
</tr>

<tr>
<td class="left">C-w v</td>
<td class="left">垂直分割当前窗口</td>
</tr>

<tr>
<td class="left">:split {file}</td>
<td class="left">水平分割当前窗口,并在新窗口载入file</td>
</tr>

<tr>
<td class="left">:vsplit {file}</td>
<td class="left">垂直分割当前窗口,并在新窗口载入file</td>
</tr>

<tr>
<td class="left">C-w w</td>
<td class="left">在窗口间循环切换</td>
</tr>

<tr>
<td class="left">C-w c或:close</td>
<td class="left">关闭活动窗口</td>
</tr>

<tr>
<td class="left">C-w o或:only</td>
<td class="left">只保留活动窗口,关闭其他所有窗口</td>
</tr>

<tr>
<td class="left">C-w =</td>
<td class="left">使所有窗口等宽,等高</td>
</tr>

<tr>
<td class="left">C-w _</td>
<td class="left">最大化活动窗口的高度</td>
</tr>

<tr>
<td class="left">[N]C-w _</td>
<td class="left">将活动窗口的高度设为N行</td>
</tr>

<tr>
<td class="left">C-w 竖线</td>
<td class="left">类似C-w _,但设置窗口的宽</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 标签页操作</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Vim的标签页是可以容纳一系列窗口的容器,它类似于Linux中的虚拟桌面的概念
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:tabedit {filename}</td>
<td class="left">在新标签页打开{filename}</td>
</tr>

<tr>
<td class="left">C-w T</td>
<td class="left">把当前窗口移到一个新标签页</td>
</tr>

<tr>
<td class="left">:tabclose</td>
<td class="left">关闭当前标签页</td>
</tr>

<tr>
<td class="left">:tabonly</td>
<td class="left">只保留当前标签页,关闭其他标签页</td>
</tr>

<tr>
<td class="left">:tabnext{n}或{N}gt</td>
<td class="left">切换到编号为{N}的标签页</td>
</tr>

<tr>
<td class="left">:tabnext或gt</td>
<td class="left">切换到下一个标签页</td>
</tr>

<tr>
<td class="left">:tabprevious或gT</td>
<td class="left">切换到上一个标签页</td>
</tr>

<tr>
<td class="left">:tabmove [N]</td>
<td class="left">将当前标签页移动到第N个位置,默认为最后一个位置</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 打开及保存文件</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 打开文件</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>:pwd          查看当前工作目录,所谓工作目录只的是vim启动时的那个目录,该目录 <b>不随着</b> buffer路径的不同而不同
</li>

<li>:edit %&lt;TAB&gt;  %符号代表缓冲区中的完整路径
</li>

<li>:edit %:h     :h修饰符会去除文件名,但保留路径部分,使用这种方式可以快速打开与活动缓冲区中文件属于同一个目录的文件
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 使用find查找文件</h3>
<div class="outline-text-3" id="text-7-2">
<p>
:find命令运行我们通过文件名打开一个文件,而无需输入该文件的完整路径. 
</p>

<p>
在使用该功能前先需要配置path选项
</p>

<ol class="org-ol">
<li>:set path+=app/**
</li>
<li>:find recvfrommb&lt;tab&gt;
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 使用netrw管理文件系统</h3>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 寄存器</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>使用寄存器

<p>
"{register}复制/删除操作
</p>
</li>

<li>无名寄存器

<p>
若没有指定寄存器,则Vim缺省使用无名寄存器,可以使用""表示. 它是极其易变的
</p>
</li>

<li>复制专用寄存器

<p>
使用y{motion}时,不仅会把内容存入无名寄存器,而会存入复制专用寄存器,可用"0来表示
</p>
</li>

<li>有名寄存器

<p>
用小些字母a-z引用寄存器,会覆盖原寄存器内容. 而用大写字母A-Z引用寄存器,则会将新内容添加到该寄存器的原有内容之后
</p>
</li>

<li>黑洞寄存器

<p>
使用"_来引用,该寄存器不保存任何内容
</p>
</li>

<li>系统剪贴板

<p>
使用"+来引用,该寄存器与系统剪贴板相关联
</p>
</li>

<li>主剪贴板

<p>
X11视窗支持另一种叫做主剪贴板的剪贴板(primary),它高村者上次被高亮选中的文本,可用用鼠标中键把他们粘贴出来. 使用"*来引用
</p>

<p>
Windows/Mac OS没有主剪贴板的概念,因此"*也代表系统剪贴板
</p>
</li>

<li>其他寄存器

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">寄存器</th>
<th scope="col" class="left">内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">"=</td>
<td class="left">表达式寄存器</td>
</tr>

<tr>
<td class="left">"%</td>
<td class="left">当前文件名</td>
</tr>

<tr>
<td class="left">"#</td>
<td class="left">轮换文件名</td>
</tr>

<tr>
<td class="left">".</td>
<td class="left">上次插入的文本</td>
</tr>

<tr>
<td class="left">":</td>
<td class="left">上次执行的Ex命令</td>
</tr>

<tr>
<td class="left">"/</td>
<td class="left">上次查找的模式</td>
</tr>
</tbody>
</table>
</li>
</ul>
</div>
</div>
