linux/Vim实用技巧.org
* 宏

  * 对多行同时执行某个宏

	* [range]normal @{register}

	* global/pattern/@{register}

  * 对多个文件同时执行宏

	* :argdo normal @{register}

	* :bufdo normal @{register}
* 模式匹配
** 调整大小写敏感

   * 匹配式中任何地方出现\C则表示开启大小写敏感模式

   * 匹配式中任何地方出现\c则表示大小写不敏感模式
** 调整正则表达式的匹配模式

   * \v表示开启very magic搜索模式,即假定除_,大小写字符和数字之外的所有字符都具有特殊含义

   * \V表示开启very nomagic原义开关,即默认消除大多数字符上的特殊含义.
** 特殊匹配符

   * <匹配左定界符

   * >匹配右定界符

   * \_s匹配空格或者回车符

   * %()只使用括号的分组功能,不捕获其内容

   * \ze和\zs对匹配进行裁剪

	 一个匹配的边界通常对应于一个模式的起始与结尾. 但我们可以使用元字符\zs和\ze对匹配进行裁剪,使其成为这个完成模式的一个子集.

	 \zs标志着一个匹配的起始,\ze用来界定匹配的结束

   * 
** 统计当前模式的匹配个数

   使用:%s///gn就可以统计当前模式的匹配个数

   标志位n会抑制正常的替换动作. 该命令不会对每次匹配进行替换,而是简单地统计匹配的次数
* 查找功能

  * /pattern//e 定位到查找匹配的结尾

  * // 将查找域留空,则Vim将重用上一次的查找模式

  * 类似的s//中将查找域留空,Vim也会重用上一次的查找模式

  * normal模式下q/打开查询历史的命令行窗口
* 替换功能
** 标志位总结
   | 标志位 | 功能                 |
   |--------+----------------------|
   | g      | 修改一行内的所有匹配 |
   | c      | 让我们有机会可以确认或拒绝每一处修改 |
   | n      | 不真正作替换,而只报告本次substitute命令匹配的个数 |
   | e      | 屏蔽错误提示                                      |
   | &      | 指示Vim重用上一次substitute命令所用过的标志位                 |
** 替换域中的特殊字符

   具体可用过:h sub-replace-special来查询完整的列表
   | 符号           | 描述                               |
   |----------------+------------------------------------|
   | \r             | 插入一个换行符                     |
   | \t             | 插入一个制表符                     |
   | \\             | 插入一个反斜杠                     |
   | \{数字}        | 插入第N个子匹配                    |
   | \0             | 插入匹配模式的所有内容             |
   | &              | 插入匹配模式的所有内容             |
   | ~              | 使用上一次调用substitute时的替换域 |
   | \={Vim Script} | 插入{Vim Script}表达式的结果              |
** 使用寄存器内容

   在命令模式下也能通过C-r{register}的方式来将寄存器内容插入命令行.

   因此在输入查询域时可以用C-r\来代替
** 重复上一次substitute命令

   * 使用g&在整个文件范围内重复substitute命令

   * 使用[range]&&在指定范围内重新执行替换操作.

   * normal模式下的&命令是:s的同义词,用于重复上一次的替换操作.但它不包含替换的标志位.

	 
* Quckfix列表与位置列表

  对于每一条用于填充quickfix列表的命令都有一条对应的命令,把结果保存到位置列表. 

  :make,:grep以及:vimgrep会实用quickfix列表,而:lmake,:lgrep,:lvimgrep实用位置列表.

  这两者的区别在于在任一特定的时刻,只能有一个quickfix列表,而位置列表却可以有多个.

  #+CAPTION:Quickfix列表命令
  | 命令    | 用途                       |
  |---------+----------------------------|
  | :cnext  | 跳转到下一项               |
  | :cprev  | 跳转到上一项               |
  | :cfirst | 跳转到第一项               |
  | :clast  | 跳转到最后一项             |
  | :cnfile | 跳转到下一个文件的第一项   |
  | :cpfile | 跳转到上一个文件的最后一项 |
  | :cc N   | 跳转到第N项                |
  | :copen  | 打开quickfix窗口           |
  | :cclose | 关闭quickfix窗口           |
  | :colder | quickfix的前一个版本       |
  | :cnew   | quickfix的后一个版本          |

  位置窗口的操作,只需要把quickfix的命令起始字符改为l即可
* 与外部程序的交互
  * makeprg选项允许我们指定运行:make时所调用的程序

  * errorformat选项允许我们告诉Vim如何解析:make产生的结果

  * grepprg选项允许我们指定允许:grep所调用的程序

  * grepformat选项指示Vim如何解析来自:grep命令的输出结果

  * :vimgrep命令允许我们实用Vim自带的正则表达式引擎,实现跨越文件的查找功能

	:vimgrep[!] /{pattern}/[g][j] {files}
* Vim中的补全功能

  * ignorecase选项会影响到补全时的大小写敏感问题

  * 触发自动补全的方法
    | 命令    | 补全类型                                                                                                                                  |
    |---------+-------------------------------------------------------------------------------------------------------------------------------------------|
    | C-n     | 普通关键字,可以通过设置complete选项来定制普通关键字补全时所扫描的位置                                                                     |
    | C-x C-n | 当前缓冲区关键字                                                                                                                          |
    | C-x C-i | 包含文件关键字,Vim本身就理解C语言的包含方式,但通过设置include选项,我们也可以让它了解其他语言的对应提示符                                  |
    | C-x C-] | tag文件关键字                                                                                                                             |
    | C-x C-k | 字典查找,可以通过dictionary选项来指定一个或多个含有单词列表的文件                                                                         |
    | C-x C-l | 整行补全                                                                                                                                  |
    | C-x C-f | 文件名补全,需要注意的是,Vim的文件自动补全功能只相对于工作目录的路径进行扩展,而不是相对于当前编辑文件的路径. 可以通过:cd命令来却换工作目录,:cd -切换到之前的工作目录 |
    | C-x C-o | 全能补全                                                                                                                                  |

  * 与自动补全的弹出式菜单相互交互
    | 按键           | 作用                     |
    |----------------+--------------------------|
    | C-n / C-p      | 实用下一个/上一个匹配项  |
    | C-y            | 确认选用当前选中的匹配项 |
    | C-e            | 还原最少输入的文本       |
    | C-h /BackSpace | 从当前匹配项删除一个字符 |
    | C-l            | 从当前匹配项增加一个字符 |
    | {char}         | 中止补全,并插入字符             |
* 拼写检查
