linux/Vim实用技巧.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 宏</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>对多行同时执行某个宏

<ul class="org-ul">
<li>[range]normal @{register}
</li>

<li>global/pattern/@{register}
</li>
</ul>
</li>

<li>对多个文件同时执行宏

<ul class="org-ul">
<li>:argdo normal @{register}
</li>

<li>:bufdo normal @{register}
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 模式匹配</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 调整大小写敏感</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>匹配式中任何地方出现\C则表示开启大小写敏感模式
</li>

<li>匹配式中任何地方出现\c则表示大小写不敏感模式
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 调整正则表达式的匹配模式</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>\v表示开启very magic搜索模式,即假定除_,大小写字符和数字之外的所有字符都具有特殊含义
</li>

<li>\V表示开启very nomagic原义开关,即默认消除大多数字符上的特殊含义.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 特殊匹配符</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>&lt;匹配左定界符
</li>

<li>&gt;匹配右定界符
</li>

<li>\_s匹配空格或者回车符
</li>

<li>%()只使用括号的分组功能,不捕获其内容
</li>

<li>\ze和\zs对匹配进行裁剪

<p>
一个匹配的边界通常对应于一个模式的起始与结尾. 但我们可以使用元字符\zs和\ze对匹配进行裁剪,使其成为这个完成模式的一个子集.
</p>

<p>
\zs标志着一个匹配的起始,\ze用来界定匹配的结束
</p>
</li>

<li></li>
</ul>
</div>
</div>
<div id="outline-container-sec-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> 统计当前模式的匹配个数</h3>
<div class="outline-text-3" id="text-10-4">
<p>
使用:%s///gn就可以统计当前模式的匹配个数
</p>

<p>
标志位n会抑制正常的替换动作. 该命令不会对每次匹配进行替换,而是简单地统计匹配的次数
</p>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 查找功能</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>/pattern//e 定位到查找匹配的结尾
</li>

<li>// 将查找域留空,则Vim将重用上一次的查找模式
</li>

<li>类似的s//中将查找域留空,Vim也会重用上一次的查找模式
</li>

<li>normal模式下q/打开查询历史的命令行窗口
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 替换功能</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 标志位总结</h3>
<div class="outline-text-3" id="text-12-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">标志位</th>
<th scope="col" class="left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">g</td>
<td class="left">修改一行内的所有匹配</td>
</tr>

<tr>
<td class="left">c</td>
<td class="left">让我们有机会可以确认或拒绝每一处修改</td>
</tr>

<tr>
<td class="left">n</td>
<td class="left">不真正作替换,而只报告本次substitute命令匹配的个数</td>
</tr>

<tr>
<td class="left">e</td>
<td class="left">屏蔽错误提示</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">指示Vim重用上一次substitute命令所用过的标志位</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 替换域中的特殊字符</h3>
<div class="outline-text-3" id="text-12-2">
<p>
具体可用过:h sub-replace-special来查询完整的列表
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">符号</th>
<th scope="col" class="left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\r</td>
<td class="left">插入一个换行符</td>
</tr>

<tr>
<td class="left">\t</td>
<td class="left">插入一个制表符</td>
</tr>

<tr>
<td class="left">\\</td>
<td class="left">插入一个反斜杠</td>
</tr>

<tr>
<td class="left">\{数字}</td>
<td class="left">插入第N个子匹配</td>
</tr>

<tr>
<td class="left">\0</td>
<td class="left">插入匹配模式的所有内容</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">插入匹配模式的所有内容</td>
</tr>

<tr>
<td class="left">~</td>
<td class="left">使用上一次调用substitute时的替换域</td>
</tr>

<tr>
<td class="left">\={Vim Script}</td>
<td class="left">插入{Vim Script}表达式的结果</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> 使用寄存器内容</h3>
<div class="outline-text-3" id="text-12-3">
<p>
在命令模式下也能通过C-r{register}的方式来将寄存器内容插入命令行.
</p>

<p>
因此在输入查询域时可以用C-r\来代替
</p>
</div>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> 重复上一次substitute命令</h3>
<div class="outline-text-3" id="text-12-4">
<ul class="org-ul">
<li>使用g&amp;在整个文件范围内重复substitute命令
</li>

<li>使用[range]&amp;&amp;在指定范围内重新执行替换操作.
</li>

<li>normal模式下的&amp;命令是:s的同义词,用于重复上一次的替换操作.但它不包含替换的标志位.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Quckfix列表与位置列表</h2>
<div class="outline-text-2" id="text-13">
<p>
对于每一条用于填充quickfix列表的命令都有一条对应的命令,把结果保存到位置列表. 
</p>

<p>
:make,:grep以及:vimgrep会实用quickfix列表,而:lmake,:lgrep,:lvimgrep实用位置列表.
</p>

<p>
这两者的区别在于在任一特定的时刻,只能有一个quickfix列表,而位置列表却可以有多个.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:cnext</td>
<td class="left">跳转到下一项</td>
</tr>

<tr>
<td class="left">:cprev</td>
<td class="left">跳转到上一项</td>
</tr>

<tr>
<td class="left">:cfirst</td>
<td class="left">跳转到第一项</td>
</tr>

<tr>
<td class="left">:clast</td>
<td class="left">跳转到最后一项</td>
</tr>

<tr>
<td class="left">:cnfile</td>
<td class="left">跳转到下一个文件的第一项</td>
</tr>

<tr>
<td class="left">:cpfile</td>
<td class="left">跳转到上一个文件的最后一项</td>
</tr>

<tr>
<td class="left">:cc N</td>
<td class="left">跳转到第N项</td>
</tr>

<tr>
<td class="left">:copen</td>
<td class="left">打开quickfix窗口</td>
</tr>

<tr>
<td class="left">:cclose</td>
<td class="left">关闭quickfix窗口</td>
</tr>

<tr>
<td class="left">:colder</td>
<td class="left">quickfix的前一个版本</td>
</tr>

<tr>
<td class="left">:cnew</td>
<td class="left">quickfix的后一个版本</td>
</tr>
</tbody>
</table>

<p>
位置窗口的操作,只需要把quickfix的命令起始字符改为l即可
</p>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 与外部程序的交互</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>makeprg选项允许我们指定运行:make时所调用的程序
</li>

<li>errorformat选项允许我们告诉Vim如何解析:make产生的结果
</li>

<li>grepprg选项允许我们指定允许:grep所调用的程序
</li>

<li>grepformat选项指示Vim如何解析来自:grep命令的输出结果
</li>

<li>:vimgrep命令允许我们实用Vim自带的正则表达式引擎,实现跨越文件的查找功能

<p>
:vimgrep[!] /{pattern}/[g][j] {files}
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Vim中的补全功能</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>ignorecase选项会影响到补全时的大小写敏感问题
</li>

<li>触发自动补全的方法
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">补全类型</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-n</td>
<td class="left">普通关键字,可以通过设置complete选项来定制普通关键字补全时所扫描的位置</td>
</tr>

<tr>
<td class="left">C-x C-n</td>
<td class="left">当前缓冲区关键字</td>
</tr>

<tr>
<td class="left">C-x C-i</td>
<td class="left">包含文件关键字,Vim本身就理解C语言的包含方式,但通过设置include选项,我们也可以让它了解其他语言的对应提示符</td>
</tr>

<tr>
<td class="left">C-x C-]</td>
<td class="left">tag文件关键字</td>
</tr>

<tr>
<td class="left">C-x C-k</td>
<td class="left">字典查找,可以通过dictionary选项来指定一个或多个含有单词列表的文件</td>
</tr>

<tr>
<td class="left">C-x C-l</td>
<td class="left">整行补全</td>
</tr>

<tr>
<td class="left">C-x C-f</td>
<td class="left">文件名补全,需要注意的是,Vim的文件自动补全功能只相对于工作目录的路径进行扩展,而不是相对于当前编辑文件的路径. 可以通过:cd命令来却换工作目录,:cd -切换到之前的工作目录</td>
</tr>

<tr>
<td class="left">C-x C-o</td>
<td class="left">全能补全</td>
</tr>
</tbody>
</table>
</li>

<li>与自动补全的弹出式菜单相互交互
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">按键</th>
<th scope="col" class="left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-n / C-p</td>
<td class="left">实用下一个/上一个匹配项</td>
</tr>

<tr>
<td class="left">C-y</td>
<td class="left">确认选用当前选中的匹配项</td>
</tr>

<tr>
<td class="left">C-e</td>
<td class="left">还原最少输入的文本</td>
</tr>

<tr>
<td class="left">C-h /BackSpace</td>
<td class="left">从当前匹配项删除一个字符</td>
</tr>

<tr>
<td class="left">C-l</td>
<td class="left">从当前匹配项增加一个字符</td>
</tr>

<tr>
<td class="left">{char}</td>
<td class="left">中止补全,并插入字符</td>
</tr>
</tbody>
</table>
</li>
</ul>
</div>
</div>
