linux/Vim实用技巧.org
** Vim拼写检查器的基本命令
   | 命令       | 用途                                                                       |
   |------------+----------------------------------------------------------------------------|
   | :set spell | 开启检查                                                                   |
   | [s 或 ]s   | 在拼写错误间响应地进行反向及正向的跳转                                     |
   | z=         | 来获取Vim提供的更正建议列表,也可以使用N z=来跳过提示,直接采纳第N个更正建议 |
   | zg         | 把当前单词添加到拼写文件                                                   |
   | zw         | 将当前单词从拼写文件中删除                                                 |
   | zug        | 撤销对当前单词的zg或zw命令                                                          |
** 使用其他拼写字典

   Vim默认以英文字典作为拼写字典,通过配置spelllang选项可以让我们更改 *本地缓冲区* 的缺省设置.

   如果我们试着加载某个尚未支持的拼写文件,Vim会自动为我们提供下载和安装的方法

   通过配置spellfile选项,我们可以指定一个文件路径,用于保存由zg和zw命令所添加,删除的单词

   spellfile可以设置多个文件,在zg前加上数字标号能指定添加到那个文件中
** 在插入模式下更正拼写错误

   在插入模式下按C-x s 或C-x C-s会触发一个特殊的自动补全(参见compl-spelling). 

   Vim会从光标位置开始进行反向扫描,直到发现一处拼写错误为止;然后提供更正建议.
