linux/Vim实用技巧.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> 拼写检查</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> Vim拼写检查器的基本命令</h3>
<div class="outline-text-3" id="text-16-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">命令</th>
<th scope="col" class="left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">:set spell</td>
<td class="left">开启检查</td>
</tr>

<tr>
<td class="left">[s 或 ]s</td>
<td class="left">在拼写错误间响应地进行反向及正向的跳转</td>
</tr>

<tr>
<td class="left">z=</td>
<td class="left">来获取Vim提供的更正建议列表,也可以使用N z=来跳过提示,直接采纳第N个更正建议</td>
</tr>

<tr>
<td class="left">zg</td>
<td class="left">把当前单词添加到拼写文件</td>
</tr>

<tr>
<td class="left">zw</td>
<td class="left">将当前单词从拼写文件中删除</td>
</tr>

<tr>
<td class="left">zug</td>
<td class="left">撤销对当前单词的zg或zw命令</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> 使用其他拼写字典</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Vim默认以英文字典作为拼写字典,通过配置spelllang选项可以让我们更改 <b>本地缓冲区</b> 的缺省设置.
</p>

<p>
如果我们试着加载某个尚未支持的拼写文件,Vim会自动为我们提供下载和安装的方法
</p>

<p>
通过配置spellfile选项,我们可以指定一个文件路径,用于保存由zg和zw命令所添加,删除的单词
</p>

<p>
spellfile可以设置多个文件,在zg前加上数字标号能指定添加到那个文件中
</p>
</div>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> 在插入模式下更正拼写错误</h3>
<div class="outline-text-3" id="text-16-3">
<p>
在插入模式下按C-x s 或C-x C-s会触发一个特殊的自动补全(参见compl-spelling). 
</p>

<p>
Vim会从光标位置开始进行反向扫描,直到发现一处拼写错误为止;然后提供更正建议.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: DarkSun</p>
<p class="date">Created: 2014-09-01 星期一 23:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7b)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
